// ❗️❗️❗️ Об'ектно-орієнтоване программування (ООП)
// ❗️ Процедурне программування

// ❗️ Об'ектно-орієнтоване программування

// Сутності ООП
// Клас
// Екземпляр
// Інтерфейс

// ❗️❗️❗️ Прототипне наслідування
// ❗️ Метод hasOwnProperty(prop)

// ❗️ Метод isPrototypeOf()

// ❗️ Метод Object.keys(obj)

// ❗️❗️❗️ Класи
// ❗️ Оголошення класу
// ❗️ Конструктор класу
// Публічни властивості

// ❗️ Об'ект парметрів (патерн)

// ❗️ Методи класу

// ❗️ Приватні властивості
// Інкапсуляція

// ❗️ Геттери і сеттери

// ❗️ Статичні властивості

// ❗️ Статичні методи

// ❗️ Наслідування класів

// ❗️ Конструктор дочірнього класу

// ❗️ Методи дочірнього класу

