'use strict';

// // ❗️❗️❗️ Об'екти
// Створення об'екту, литерал об'екту

// властивості

// вкладенність об'ектів та властивостей

// ключи та значення

// звернення до властивостей (через крапку)

// коротке звернення до властивості

// звернення до вкладенних властивостей

// звернення до властивостей через квадратні дужки

// додавання ключів

// зміна значення властиволсті

// обчислювані властивості

// ❗️❗️❗️ Методи об'екта

// Доступ до властивостей обї'екта в методах (this)

// Цикл for...in

// Метод Object.create()
// Прототипне наслідування

// Метод hasOwnProperty()

// Метод Object.key()

// Метод Object.values()

// Метод Object.entries()

// Метод Object.freeze()

// Метод Object.assign()

// ❗️❗️❗️ Масив об'ектів



