// // ❗️❗️❗️ Поширення подій (event propagation)
// // Кожна поія проходе 3 фази:
// // - Звнурення (Capturing phase) - починається на window та закінчуєтиься на елементі, на якому відбулапся дія.
// // - Таргетінг (Target phase) - подія дійшла джо цельового елемента, містить повідомлення, що на цьоаму елементі відбуласмя подія.
// // - Спливання (Bubbeling phase) - подія спливає від цільового елемента через усіф еоементи-предки до window. Фаза використовується на практиці (найчастіше).
// // Під час настання події обробники спочатку спрацьовують на найбільш вкладеному елементі, потім на батьківському, і так далі вище. Таким чином, при спливанні події будут виконуватись обробникі подій на кожному елементі предку, на якому є слухач однотипноїх події, та викликати всі обробники на своєму шляху. Для спростування спливу викликається метод event.stopPropagation().
// // ❗️ Метод event.stopPropagation() зупиняє спливання та обробку події слухачамі елементів-предків (запобігає спрацьовуванню обробки події слухачамі предків).
// // ❗️ Метод stopImmediatePropagation() зупиняє всі обробникі подій на поточному елементі (в місці застосування) та вище (не є бажаним, тому що в системі можуть виконувартися обробникі подій для аналітики, або обробка подій, не урахованих в поточному коді/скрипті)

// // ❗️ Властивість event.target - найглибший елемент, на якому спіймано подію.
// // event.target - елемент, внутрі батьківського зі слухачем, на якому було викликано подію, тобто на якому було клікнуто.
// // event.currentTarget - елемент, на якому виконується обробник події, той елемент, на котрому увімкнуто слухач та виконується обробка події.

// // ❗️❗️❗️ Делегування подій
// // Якщо є группа сусідніх елементів, для яких потрібно однакову виконувати обробку однакових подій, то слухач та обробник подіі має сенс додавати на батьківського елемента та використовувати властивість event.target для ідентифікації того самого елемента нащадка, на якому виконалдася подія. Так як слухач займає місце в пам'яті, то це дозволяє не завантажувати пам'ять використанням кіфлькох слухачів, а застосовувати один слухач для безлічи дочірніх елементів. Також це дозволяє змінювати набір неащадкових елементів, не зачіпляючі та не змінюючі слухач та обробник події.
// // Для event.target обов'язково необхідно перевіряти цільовой елемент подіі для коректного її опрацювання. Для цього використовується властивість nodeName, а назва тега елемента пишеться в UPPER_CASE:
// // if (event.target.nodeName !== "BUTTON") {
// //   return; // якщо клікнуто не на кнопку, то нічого не виконується - обробнике виконується лише на кліку на кнопку
// // }

// // Але більш правільно буде використовувати для ідентіфікації цільового елемента (таргета) звернення по класу:
// //if (!event.target.classList.contains('<назва_класу>')) {
// //  return; // якщо клікнуто не на елемент з зазначеним класом, то нічого не виконується - обробнике виконується лише на кліку на на елемент з зазначеним класом
// //}

// // Таку перевірку доречно застосовувати зверненням дло зворотнього (!), щоб не роздувати тіло if'а, тобто - якщо не відповідає умові if'а - виходимо з функції, а код обробки події винесено за тіло if'а.

// // ❗️ Властивість closest() використовується длля пошуку найближчего елемаента-пращура по селектору. Так, якщо подія була спіймана на чкомусь елементі без класу та потрібно відстежити його предка за класом. Нибито querySelector() назовні.

// // ❗️❗️❗️ Trottle, Debounce
// // ❗️ Chatty events - події, що спрацьовують часто.ю наприклад відстеження переміщення миши/курсора, зміна розміру вікна, скроллб введення тексту ('input'). Такі події спрацьовують досить часто та маэ велике навантаження на браузер та викликають пробле ми с продуктывнысю, особливо якщо обробка таких подій має доси багато коду/функцій, але така часта обробка їх не має сенсу.
// // Trottle та Debounce - прийому з бібліотеці Lodash (https://lodash.com/), яки дозволяють ограничити частоту спрацювання слухача та виконання функції обробки події.

// // 💡 В Trottle та Debounce не працюють посилання на currentTarget! При використанні ціх методів для звернення до об'єкту події необхідно застосовувати посилання до target!

// // ❗️ CDN (Content Delivery Network) - географічно розподілена мирежева інфраструктура, яка забесмпечує швидку доставку контенту користувачам сайтів та веб-сервісів. Зберігає бібліотекі та інши сервіси та їх дозволяє підключати до сайту, забеспечующи макси мальну швідкість доставки до браузера користувача.

// // Підключення бібліотек може бути за посиланням - через додання посилання на скрипт в HTML (такім ож чином, як підключення скрипта js, але сама бібліотека може бути досить велика, та не бути використована в повному обсязі на робочому мічці користувача, а потрібні лише кілька окремих її частин) або локальною (заванитажено на станції розробника та експортом в js, а до браузера користувача буде відправлена тільки та частина коду бібліотеці, яка необхідна).

// // ❗️ Метод Trottle - огранічує пегулярність виконання функції один раз в заданий проміхжок часу в мілісекундах. Не огранічужє частоту реєстрації події браузером, а впливає на частоту виконання функціїї обробника події. Першим аргументом передається функеція-обробник, другим - кількість мілісекунд. Повертає нову функцію для передачи в слухач події. В метолді можуть застосовуватися додаткові опції для завдання поведінки - детальніше в документації, застосовуються рідко, по дефолту { leading: true, trailing: true }.

// console.log(_.throttle);

// document.addEventListener(
//   "scroll",
//   _.throttle(() => {
//     console.log("Scroll handler call every 300 ms");
//   }, 300)
// );

// // ❗️ Метод Debounce - встановлює часовий відступ в мілісекундах для урахування паузи після завершення подій для виклику функції. Якщо подія знов була виконана до закінчення паузи, то функція не буде викликана. Першим аргументом передається функеція-обробник, другим - кількість мілісекунд. Повертає нову функцію для передачи в слухач події.

// document.addEventListener(
//   "scroll",
//   _.debounce(() => {
//     console.log("Scroll handler call after 300 ms pause");
//   }, 300)
// );

// // По дефолту Debounce працює у режимі trailing edge (в кінці), коли функція викликається в паузі между потокамі подій. Але може використовуватися в режимі leading edge (на початку) - виклик функції-обробника виконується під час настання першой події потока, а потім ігноруються всі наступні подіі до паузи, довжина якої задана як аргумент. На старті наступного потоку події функція-обробник вновь беде викликана. Для завдання токої поведінки методу потрібно передати третій аргумент об'ект параметрів (по дефолту, та якщо не задано: {leading: false, trailing: true,}. Тобто для зміни поведінки метод має такий сінтаксичний вигляд:

// document.addEventListener(
//   "scroll",
//   _.debounce(
//     () => {
//       console.log("Scroll handler call after 300 ms pause");
//     },
//     300,
//     { leading: true, trailing: false }
//   )
// );

// // Може застосовуватися, наприклад, коли необхідно виконати функцію відпроавлення запиту на сервер по першому натисканні на кнопку, а потім ігнорувати повторні натискання до паузи.

// // ❗️❗️❗️ lazy-loading - відкладене завантаження.
// // Застосовується для зображень, щоб зменшити навантаження на з'еднення та ресуси пристрою при завантаженні зображень. Браузер завантажує лише ті зображення, які потрапляють в відиму на екрані частину сайта та кілька зображень, які можуть бути показані при скролі екрану, але не завантажує на початку ті зображення, які знаходяться значно ніжче на сторінці, та дозавантажує їх по мірі наближення до ніх.
// // Режим підключається як атрибут в HTML-тегі img:
// // <img src="image.jpg" loading="lazy" alt="Image" />
// // Підтримує три значення:
// // lazy - виконується відкладене завантаженя
// // eager - зображення завантажується при першої нагоді, ьтобто без відкладення
// // auto - браузер сам визначає режим завантаження (дефолтне значення)

// // Режим нативно підтримується сучасними браузерамі, крім Safari. Але для роботи в Safari та застарілих браузерах потрібно підключати бібліотекі, аки гарантовано забеспечують кросбраузерність (але додатково навантажують браузер, пристрій та мережу). Подробиці в документації.
// // lazysizes (https://afarkas.github.io/lazysizes/index.html)
// // vanilla-lazyload (https://www.andreaverlicchi.eu/vanilla-lazyload/)
// // lozad.js (https://apoorv.pro/lozad.js/)

// // ❗️❗️❗️ Feather-detecting - виявлення можливостей брайзера та виколристання натівних мождивостей або бібліотек.
// // https://web.dev/articles/browser-level-image-lazy-loading

// // ❗️❗️❗️ Перевірка розмірів пакетів бібліотек
// // https://bundlephobia.com/
