// ❗️❗️❗️ Об'єктно-орієнтоване програмування (ООП)
// ❗️ Процедурне програмування

// ❗️ Об'єктно-орієнтоване програмування

// Сутності ООП
// Клас
// Екземпляр
// Інтерфейс

// ❗️❗️❗️ Прототипне наслідування
// ❗️ Метод hasOwnProperty(prop)

// ❗️ Метод isPrototypeOf()

// ❗️ Метод Object.keys(obj)

// ❗️❗️❗️ Класи
// ❗️ Оголошення класу
// ❗️ Конструктор класу
// Публічні властивості

// ❗️ Об'єкт параметрів (патерн)

// ❗️ Методи класу

// ❗️ Приватні властивості
// Інкапсуляція

// ❗️ Геттери і сеттери

// ❗️ Статичні властивості

// ❗️ Статичні методи

// ❗️ Наслідування класів

// ❗️ Конструктор дочірнього класу

// ❗️ Методи дочірнього класу
