// // ❗️❗️❗️ Робота з терміналом
// https://tproger.ru/translations/bash-cheatsheet
// https://habr.com/ru/companies/ruvds/articles/445270/

// Основні команди:
/*
Відкриття:
    Ctrl + ~
Поточне розташування (шлях)
    pwd
Перелік вмісту поточноїх текі, з опціюю 
    ls
    * -a для відображення схованих елементів
    * -l виведення як лист
Перехід по адресі (навігація)
    cd
    * cd .. - переміщення на теку вище з двома крапкамі
    * cd ../../ - переміщення на 2 текs вище
    * cd адр_теці_нижче/адр_теці_ще_нижче/ - перехід по вкладеним текам
   
   
Очищення термінала
    Ctrl + l
    clear * команда 
Створення файлу
    touch
Створення текі
    mkdir
Перейменування / переміщення
    mv
Вилучення
    rm
*/
